ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_c29_seccall_stack_regs.xml
<module id="C29_SECCALL_STACK" HW_revision="" description="C29 SECCALL STACK Registers">
	<group id="C29_SECCALL_STACK_RegisterFile0" name="C29_SECCALL_STACK_RegisterFile0" instances="17" offset="0x0" instaddr="16">
		<register id="SECCALL_STACK_DATA0" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="SECCALL stack Data0">
			<bitfield id="SECCALL_STACK_DATA0" description="Secure call stack Data0" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="SECCALL_STACK_DATA1" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="SECCALL stack Data1">
			<bitfield id="SECCALL_STACK_DATA1" description="Secure call stack Data1" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="SECCALL_STACK_DATA2" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="SECCALL stack Data2">
			<bitfield id="SECCALL_STACK_DATA2" description="Secure call stack Data2" begin="3" end="0" width="4" rwaccess="RW"/>
		</register>
	</group>
</module>
